In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect("titanic.db")
curs = conn.cursor()
curs.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(curs.fetchall())

[('titanic',)]

In [3]:
curs.execute("SELECT * FROM titanic")
curs.fetchmany(1)

[('1',
  '0',
  '3',
  'Braund, Mr. Owen Harris',
  'male',
  '22',
  '1',
  '0',
  'A/5 21171',
  '7.25',
  None,
  'S')]

In [21]:
query = "SELECT * FROM titanic"
df = pd.read_sql_query(query, conn)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilyCount,IsReverend
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,**EMPTY**,S,2,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,2,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,**EMPTY**,S,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S,2,0
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,**EMPTY**,S,1,0

In [7]:
curs.execute("SELECT COUNT(*) - COUNT(Embarked) FROM titanic")
curs.fetchall()

[(0,)]

In [6]:
curs.execute("DELETE FROM titanic WHERE Embarked IS NULL")
conn.commit()

In [9]:
curs.execute("UPDATE titanic SET cabin='**EMPTY**' WHERE cabin IS NULL")
conn.commit()

In [10]:
curs.execute("SELECT COUNT(cabin) FROM titanic WHERE cabin='**EMPTY**'")
curs.fetchall()

[(687,)]

In [11]:
curs.execute("ALTER TABLE titanic ADD FamilyCount INT")
conn.commit()

In [13]:
curs.execute("UPDATE titanic SET FamilyCount=sibsp + parch + 1")
conn.commit()

In [15]:
curs.execute("ALTER TABLE titanic ADD IsReverend BOOLEAN")
conn.commit()

In [16]:
curs.execute("UPDATE titanic SET IsReverend = 1 WHERE Name LIKE '%Rev%'")
conn.commit()

In [17]:
curs.execute("UPDATE titanic SET IsReverend = 0 WHERE Name NOT LIKE '%Rev%'")
conn.commit()

In [24]:
curs.execute("SELECT SUM(Survived) / 889.0 FROM titanic")
curs.fetchall()

[(0.38245219347581555,)]

In [25]:
curs.execute("SELECT AVG(Survived) FROM titanic")
curs.fetchall()

[(0.38245219347581555,)]

In [27]:
curs.execute("SELECT AVG(Survived) FROM titanic WHERE Sex='male'")
curs.fetchall()

[(0.18890814558058924,)]

In [28]:
curs.execute("SELECT AVG(Survived) FROM titanic WHERE Sex='female'")
curs.fetchall()

[(0.7403846153846154,)]

In [30]:
curs.execute("SELECT Pclass,Sex, AVG(Survived) FROM titanic GROUP BY Pclass, Sex")
curs.fetchall()

[('1', 'female', 0.967391304347826),
 ('1', 'male', 0.36885245901639346),
 ('2', 'female', 0.9210526315789473),
 ('2', 'male', 0.1574074074074074),
 ('3', 'female', 0.5),
 ('3', 'male', 0.13544668587896252)]